app/Models/ApiModel.php

    public function getPlayRoundScore($date, $studentId)
    {
        $builder = $this->db->table('games');
        $builder->select('*');
        // $builder->from('games');
        $builder->where('DateTime', $date);
        $builder->where('StudentId', $studentId);
        // $builder->where('GameType', 2);
        $query = $builder->get();
---
SELECT *
FROM `games`
WHERE `DateTime` = '2024-10-26 11:31:14'
AND `StudentId` = '72'

    public function insertUserData($role, $email, $hashedPassword, $profile)
    {
        $data = [
            'Role' => $role,
            'Email' => $email,
            'Password' => $hashedPassword,
            'Profile_FirstName' => $profile['firstName'],
            'Profile_LastName' => $profile['lastName'],
            'Profile_Phone' => $profile['phone'],
            'Profile_Gender' => $profile['gender'],
            'Profile_Age' => $profile['age'],
            'Profile_Hcp' => $profile['hcp'],
            'Profile_HealthLimitation' => $profile['healthLimitation'],
            'Profile_DistanceUnit' => $profile['distanceUnit'],
            'Profile_SpeedUnit' => $profile['speedUnit']
        ];

        $this->db->table('users')->insert($data);
---
INSERT INTO `users` (`Role`, `Email`, `Password`, `Profile_FirstName`, `Profile_LastName`, `Profile_Phone`, `Profile_Gender`, `Profile_Age`, `Profile_Hcp`, `Profile_HealthLimitation`, `Profile_DistanceUnit`, `Profile_SpeedUnit`) VALUES (1, 'amirjamal496@gmail.com', '$2y$10$7KOTcO5QgGdej5.czPbO.Onl4aeZabUO0uBAbrpO2S3OKd5/IbNqm', 'Aamir', 'Jamal', '1234567890', 'male', 30, 'HCP', 'none', 'km', 'km/h')

    public function getUserByEmail($email)
    {
        $builder = $this->db->table('users')->where('Email',$email);
---
SELECT *
FROM `users`
WHERE `Email` = 'raeeskhan3370@gmail.com'

    public function getUsersByRole($role)
    {
        // $query = $this->db->get_where('users', array('role' => $role));
        $builder = $this->db->table('users');
        $query =$builder->where('role',$role)->get();
---
SELECT *
FROM `users`
WHERE `role` = '1'